src/Documents/НакладнаяНаСборку/НакладнаяНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НакладнаяНаСборку</name>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДоставки</name>
    <type>
      <types>CatalogRef.КартыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомераТары</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрупныйЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БарКоды</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>БарКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗоныКомплектации</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Тары</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.ТранспортировочныеТары</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/РезервированиеГП/РезервированиеГП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервированиеГП</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/МестаХранения/МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МестаХранения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ГТД/ГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ГТД</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыМПЗ/ВидыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМПЗ</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
</mdclass:Enum>

src/Documents/НакладнаяНаСборку/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(Формат(Дата,"ДФ=гг")+"-");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//Расход Резервирование ГП
Движения.РезервированиеГП.Записывать = Истина;
	Для Каждого ТЧ Из ТабличнаяЧасть Цикл
		Если ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
		МестоХранения = ТЧ.Продукция.Линейка.МестоХраненияГП;
		Иначе	
		МестоХранения = Константы.МестоХраненияТНП.Получить();
		КонецЕсли;
	КоличествоОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокВРезерве(МестоХранения,ТЧ.Продукция,ТЧ.ЗаказНаПроизводство,Дата);
		Если КоличествоОстаток >= ТЧ.Количество Тогда
		Движение = Движения.РезервированиеГП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.МестоХранения = МестоХранения;
		Движение.Продукция = ТЧ.Продукция;
		Движение.Документ = ТЧ.ЗаказНаПроизводство;
		Движение.Количество = ТЧ.Количество;		
		Иначе	
		Отказ = Истина;
		Сообщить("Продукция: "+СокрЛП(ТЧ.Продукция.Наименование)+" требуется: "+ТЧ.Количество+" недостаёт в резерве: "+Строка(ТЧ.Количество-КоличествоОстаток));		
		КонецЕсли;		
	КонецЦикла;
МестоХраненияВ = Константы.МестоХраненияТранзит.Получить();	
ВиртуальнаяТабличнаяЧасть = ТабличнаяЧасть.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("Продукция","Количество");
Движения.МестаХранения.Записывать = Истина;
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл
		Если ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		МестоХранения = ТЧ.Продукция.Линейка.МестоХраненияГП;
		Иначе	
		ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		МестоХранения = Константы.МестоХраненияТНП.Получить();
		КонецЕсли;
	КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХранения,ТЧ.Продукция,Дата);
		Если КолОстаток >= ТЧ.Количество Тогда
		Движение = Движения.МестаХранения.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.МестоХранения = МестоХранения;
		Движение.ВидМПЗ = ВидМПЗ;
		Движение.МПЗ = ТЧ.Продукция;
		Движение.Количество = ТЧ.Количество;

		Движение = Движения.МестаХранения.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.МестоХранения = МестоХраненияВ;
		Движение.ВидМПЗ = ВидМПЗ;
		Движение.МПЗ = ТЧ.Продукция;
		Движение.Количество = ТЧ.Количество;
		Иначе
		Отказ = Истина;
		Сообщить("Продукция: "+СокрЛП(ТЧ.Продукция.Наименование)+" требуется: "+ТЧ.Количество+" недостаёт на складе: "+Строка(ТЧ.Количество-КолОстаток));
		КонецЕсли;		 
	КонецЦикла;
Запрос = Новый Запрос;
// регистр ГТД Расход
Движения.ГТД.Записывать = Истина;
	Для Каждого ТЧ Из ТабличнаяЧасть Цикл
	КоличествоОстаток = ТЧ.Количество;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГТДОстатки.НомерГТД КАК НомерГТД,
		|	ГТДОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ГТД.Остатки(&НаДату, Товар = &Товар) КАК ГТДОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГТДОстатки.НомерГТД.ДатаВнесения";
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("Товар", ТЧ.Продукция);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если КоличествоОстаток > 0 Тогда
			Движение = Движения.ГТД.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = ТЧ.Продукция;
			Движение.НомерГТД = ВыборкаДетальныеЗаписи.НомерГТД;
				Если ВыборкаДетальныеЗаписи.КоличествоОстаток <= КоличествоОстаток Тогда
				Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
				КоличествоОстаток = КоличествоОстаток - ВыборкаДетальныеЗаписи.КоличествоОстаток;
				Иначе
				Движение.Количество = КоличествоОстаток;
				КоличествоОстаток = 0;
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
